<?php
$server ="localhost";
$username ="root";
$password="";
$dbname = "hotel";
$connect = mysqli_connect($server,$username,$password,$dbname);
if (!$connect){
  echo "Kết nối thất bại" . $mysqli_connect_error;
  exit();
}
$sql = "INSERT INTO tb_hoadonthanhtoan(`Mã HĐ`,`Mã NKDP`,`Mã KH`,`Đơn giá DV`,`Đơn giá phòng`,`Ngày lập HĐ`)
             VALUES ('HA02','KA02','09','14.580.000 VNĐ','87.912.000 VNĐ','2024/3/4'),
                    ('HA01','KA01','11','7.793.000 VNĐ','51.688.000 VNĐ','2023/12/1'),
                    ('HB05','KB05','06','6.291.000 VNĐ','55.831.000 VNĐ','2023/10/22'),
                    ('HS02','KS02','19','5.698.000 VNĐ','47.285.000 VNĐ','2023/9/21'),
                    ('HB04','KB04','25','3.020.000 VNĐ','11.516.000 VNĐ','2023/8/9'),
                    ('HC05','KC05','16','4.087.000 VNĐ','20.114.000 VNĐ','2023/6/10'),
                    ('HB03','KB03','21','910.000 VNĐ','4.832.000 VNĐ','2022/5/5'),
                    ('HD06','KD06','18','0 VNĐ','34.300.000 VNĐ','2023/5/30'),
                    ('HD05','KD05','22','1.300.000 VNĐ','6.092.000 VNĐ','2023/3/12'),
                    ('HB02','KB02','02','0 VNĐ','0 VNĐ','2023/2/1'),
                    ('HC04','KC04','08','200.000 VNĐ','3.019.000 VNĐ','2023/1/22'),
                    ('HC03','KC03','20','4.327.000 VNĐ','29.082.000 VNĐ','2023/1/25'),
                    ('HC02','KC02','01','2.212.000 VNĐ','5.632.000 VNĐ','2022/12/25'),
                    ('HB01','KB01','12','3.054.000 VNĐ','32.239.000 VNĐ','2022/12/14'),
                    ('HD04','KD04','14','5.450.000 VNĐ','44.279.000 VNĐ','2022/9/3'),
                    ('HS01','KS01','13','0 VNĐ','19.993.000 VNĐ','2022/6/21'),
                    ('HC01','KC01','05','1.507.000 VNĐ','10.122.000','2022/6/2'),
                    ('HD03','KD03','27','3.403.000 VNĐ','34.726.000 VNĐ','2022/6/21'),
                    ('HD02','KD02','23','1.990.000 VNĐ','10.452.000 VNĐ','2022/2/21'),
                    ('HD01','KD01','07','1.220.000 VNĐ','9.801.000 VNĐ','2021/2/9')";

if(mysqli_query($connect,$sql)){
    echo "Nhập dữ liệu thành công!";
}else {
    echo "Lỗi!".mysqli_error();
}
?>