<?php
$server ="localhost";
$username ="root";
$password="";
$dbname = "hotel";
$connect = mysqli_connect($server,$username,$password,$dbname);
if (!$connect){
  echo "Kết nối thất bại" . $mysqli_connect_error;
  exit();
}
$sql = "INSERT INTO tb_nhatkydatphong(`Mã NKDP`,`Mã KH`,`Mã KM`,`Ngày đặt`,`Ngày lấy phòng`,`Ngày dự kiến trả phòng`,`Đơn giá`,`Tiền cọc`,`Ghi chú`)
        VALUES      ('KA02','09','500321','2023/12/5','2023/12/5','2024/3/4','102.492.000 VNĐ','1.000.000 VNĐ','Lấy phòng vào lúc 3:00 và trả lúc 18:54'),
                    ('KA01','11','136136','2023/11/2','2023/11/2','2023/12/1','59.481.000 VNĐ','1.000.000 VNĐ','Lấy phòng vào lúc 15:30 và trả lúc 14:08'),
                    ('KB05','06','0','2023/9/14','2023/9/15','2023/10/22','62.122.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 2:02 và trả lúc 11:46'),
                    ('KS02','19','0','2023/9/3','2023/9/3','2023/9/21','52.983.000 VNĐ','1.000.000 VNĐ ', 'Lấy phòng vào lúc 19:20 và trả lúc 16:30'),
                    ('KB04','25','136136','2023/7/31','2023/8/1','2023/8/9','14.536.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 16:24 và trả lúc 13:08'),
                    ('KC05','16','500344','2023/7/19','2023/7/20','2023/6/10','24.201.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 17:29 và trả lúc 19:53'),
                    ('KB03','21','0','2023/5/3','2023/5/3','2022/5/5','5.743.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 23:21 và trả lúc 10:53'),
                    ('KD06','18','0','2023/4/28','2023/4/29','2023/5/30','34.300.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 21:20 và trả lúc 00:00'),
                    ('KD05','22','0','2023/3/8','2023/3/8','2023/3/12','7.392.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 21:59 và trả lúc 22.31'),              
                    ('KB02','02','136136','2023/1/31','0','0','500.000 VNĐ','500.000 VNĐ ',' Khách không lấy phòng'),
                    ('KC04','08','517223','2023/1/21','2023/1/21','2023/1/22','3.219.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 5:02 và trả lúc 11:00'),
                    ('KC03','20','211269','2023/1/1','2023/1/2','2023/1/25','33.409.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 6:00 và trả lúc 2:21'),
                    ('KC02','01','502412','2022/12/24','2022/12/24','2022/12/25','7.848.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 1:31 và trả lúc 4:27'),
                    ('KB01','12','514687','2022/11/19','2022/11/20','2022/12/14','35.293.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 17:39 và trả lúc 8:47'),
                    ('KD04','14','507555','2022/8/9','2022/8/9','2022/9/3','49.729.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 3:38 và trả lúc 22:01'),
                    ('KS01','13','0','2022/6/12','2022/6/12','2022/6/21','19.993.000 VNĐ','1.000.000 VNĐ','Lấy phòng vào lúc 17:20 và trả lúc 9:23'),
                    ('KC01','05','508923','2022/5/29','2022/5/29','2022/6/2','11.629.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 21:00 và trả lúc 13:03'),
                    ('KD03','27','0','2022/5/1','2022/5/1','2022/6/21','38.129.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 14:47 và trả lúc 16:33'),
                    ('KD02','23','504411','2022/2/14','2022/2/14','2022/2/21','12.442.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 18:01 và trả lúc 9:10'),
                    ('KD01','07','0','2021/2/1','2021/2/1','2021/2/9','11.021.000 VNĐ','500.000 VNĐ','Lấy phòng vào lúc 21:00 và trả lúc 2:02')
                    ";
if(mysqli_query($connect,$sql)){
    echo "Nhập dữ liệu thành công!";
}else {
    echo "Lỗi!".mysqli_error();
}
?>